---
kind: property
id: P:Autodesk.Revit.DB.StructuralAsset.SubClass
source: html/16895fd5-6654-35c4-ff28-433bd3ae34d7.htm
---
# Autodesk.Revit.DB.StructuralAsset.SubClass Property

The sub-class of the asset.

## Syntax (C#)
```csharp
public string SubClass { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - When setting this property: A non-optional argument was null